GreatCowBASIC/DATFileGenerator/incfiles/p18F04Q41.inc
;----- CWG1PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
CWGINPPS0        EQU  H'0000'
CWGINPPS1        EQU  H'0001'
CWGINPPS2        EQU  H'0002'
CWGINPPS3        EQU  H'0003'
CWGINPPS4        EQU  H'0004'
CWGINPPS5        EQU  H'0005'
CWG1INPPS0       EQU  H'0000'
CWG1INPPS1       EQU  H'0001'
CWG1INPPS2       EQU  H'0002'
CWG1INPPS3       EQU  H'0003'
CWG1INPPS4       EQU  H'0004'
CWG1INPPS5       EQU  H'0005'
CWG1INPPS0       EQU  H'0000'
CWG1INPPS1       EQU  H'0001'
CWG1INPPS2       EQU  H'0002'
CWG1INPPS3       EQU  H'0003'
CWG1INPPS4       EQU  H'0004'
CWG1INPPS5       EQU  H'0005'
CWGINPPS0        EQU  H'0000'
CWGINPPS1        EQU  H'0001'
CWGINPPS2        EQU  H'0002'
CWGINPPS3        EQU  H'0003'
CWGINPPS4        EQU  H'0004'
CWGINPPS5        EQU  H'0005'


;----- MD1CARLPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
MDCARLPPS0       EQU  H'0000'
MDCARLPPS1       EQU  H'0001'
MDCARLPPS2       EQU  H'0002'
MDCARLPPS3       EQU  H'0003'
MDCARLPPS4       EQU  H'0004'
MDCARLPPS5       EQU  H'0005'
MDCARLPPS0       EQU  H'0000'
MDCARLPPS1       EQU  H'0001'
MDCARLPPS2       EQU  H'0002'
MDCARLPPS3       EQU  H'0003'
MDCARLPPS4       EQU  H'0004'
MDCARLPPS5       EQU  H'0005'


;----- MD1CARHPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
MDCARHPPS0       EQU  H'0000'
MDCARHPPS1       EQU  H'0001'
MDCARHPPS2       EQU  H'0002'
MDCARHPPS3       EQU  H'0003'
MDCARHPPS4       EQU  H'0004'
MDCARHPPS5       EQU  H'0005'
MDCARHPPS0       EQU  H'0000'
MDCARHPPS1       EQU  H'0001'
MDCARHPPS2       EQU  H'0002'
MDCARHPPS3       EQU  H'0003'
MDCARHPPS4       EQU  H'0004'
MDCARHPPS5       EQU  H'0005'


;----- MD1SRCPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
MDSRCPPS0        EQU  H'0000'
MDSRCPPS1        EQU  H'0001'
MDSRCPPS2        EQU  H'0002'
MDSRCPPS3        EQU  H'0003'
MDSRCPPS4        EQU  H'0004'
MDSRCPPS5        EQU  H'0005'
MDSRCPPS0        EQU  H'0000'
MDSRCPPS1        EQU  H'0001'
MDSRCPPS2        EQU  H'0002'
MDSRCPPS3        EQU  H'0003'
MDSRCPPS4        EQU  H'0004'
MDSRCPPS5        EQU  H'0005'


;----- CLCIN0PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
CLCIN0PPS0       EQU  H'0000'
CLCIN0PPS1       EQU  H'0001'
CLCIN0PPS2       EQU  H'0002'
CLCIN0PPS3       EQU  H'0003'
CLCIN0PPS4       EQU  H'0004'
CLCIN0PPS5       EQU  H'0005'
CLCIN0PPS0       EQU  H'0000'
CLCIN0PPS1       EQU  H'0001'
CLCIN0PPS2       EQU  H'0002'
CLCIN0PPS3       EQU  H'0003'
CLCIN0PPS4       EQU  H'0004'
CLCIN0PPS5       EQU  H'0005'


;----- CLCIN2PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
CLCIN2PPS0       EQU  H'0000'
CLCIN2PPS1       EQU  H'0001'
CLCIN2PPS2       EQU  H'0002'
CLCIN2PPS3       EQU  H'0003'
CLCIN2PPS4       EQU  H'0004'
CLCIN2PPS5       EQU  H'0005'
CLCIN2PPS0       EQU  H'0000'
CLCIN2PPS1       EQU  H'0001'
CLCIN2PPS2       EQU  H'0002'
CLCIN2PPS3       EQU  H'0003'
CLCIN2PPS4       EQU  H'0004'
CLCIN2PPS5       EQU  H'0005'


;----- CLCIN3PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
CLCIN3PPS0       EQU  H'0000'
CLCIN3PPS1       EQU  H'0001'
CLCIN3PPS2       EQU  H'0002'
CLCIN3PPS3       EQU  H'0003'
CLCIN3PPS4       EQU  H'0004'
CLCIN3PPS5       EQU  H'0005'
CLCIN3PPS0       EQU  H'0000'
CLCIN3PPS1       EQU  H'0001'
CLCIN3PPS2       EQU  H'0002'
CLCIN3PPS3       EQU  H'0003'
CLCIN3PPS4       EQU  H'0004'
CLCIN3PPS5       EQU  H'0005'


;----- ADACTPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
ADACTPPS0        EQU  H'0000'
ADACTPPS1        EQU  H'0001'
ADACTPPS2        EQU  H'0002'
ADACTPPS3        EQU  H'0003'
ADACTPPS4        EQU  H'0004'
ADACTPPS5        EQU  H'0005'
ADACTPPS0        EQU  H'0000'
ADACTPPS1        EQU  H'0001'
ADACTPPS2        EQU  H'0002'
ADACTPPS3        EQU  H'0003'
ADACTPPS4        EQU  H'0004'
ADACTPPS5        EQU  H'0005'


;----- SPI2SCKPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
SPI2SCKPPS0      EQU  H'0000'
SPI2SCKPPS1      EQU  H'0001'
SPI2SCKPPS2      EQU  H'0002'
SPI2SCKPPS3      EQU  H'0003'
SPI2SCKPPS4      EQU  H'0004'
SPI2SCKPPS5      EQU  H'0005'
SPI2SCKPPS0      EQU  H'0000'
SPI2SCKPPS1      EQU  H'0001'
SPI2SCKPPS2      EQU  H'0002'
SPI2SCKPPS3      EQU  H'0003'
SPI2SCKPPS4      EQU  H'0004'
SPI2SCKPPS5      EQU  H'0005'


;----- SPI2SDIPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
SPI2SDIPPS0      EQU  H'0000'
SPI2SDIPPS1      EQU  H'0001'
SPI2SDIPPS2      EQU  H'0002'
SPI2SDIPPS3      EQU  H'0003'
SPI2SDIPPS4      EQU  H'0004'
SPI2SDIPPS5      EQU  H'0005'
SPI2SDIPPS0      EQU  H'0000'
SPI2SDIPPS1      EQU  H'0001'
SPI2SDIPPS2      EQU  H'0002'
SPI2SDIPPS3      EQU  H'0003'
SPI2SDIPPS4      EQU  H'0004'
SPI2SDIPPS5      EQU  H'0005'


;----- SPI2SSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
SPI2SSPPS0       EQU  H'0000'
SPI2SSPPS1       EQU  H'0001'
SPI2SSPPS2       EQU  H'0002'
SPI2SSPPS3       EQU  H'0003'
SPI2SSPPS4       EQU  H'0004'
SPI2SSPPS5       EQU  H'0005'
SPI2SSPPS0       EQU  H'0000'
SPI2SSPPS1       EQU  H'0001'
SPI2SSPPS2       EQU  H'0002'
SPI2SSPPS3       EQU  H'0003'
SPI2SSPPS4       EQU  H'0004'
SPI2SSPPS5       EQU  H'0005'


;----- I2C1SDAPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
I2C1SDAPPS0      EQU  H'0000'
I2C1SDAPPS1      EQU  H'0001'
I2C1SDAPPS2      EQU  H'0002'
I2C1SDAPPS3      EQU  H'0003'
I2C1SDAPPS4      EQU  H'0004'
I2C1SDAPPS5      EQU  H'0005'
I2C1SDAPPS0      EQU  H'0000'
I2C1SDAPPS1      EQU  H'0001'
I2C1SDAPPS2      EQU  H'0002'
I2C1SDAPPS3      EQU  H'0003'
I2C1SDAPPS4      EQU  H'0004'
I2C1SDAPPS5      EQU  H'0005'


;----- I2C1SCLPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
I2C1SCLPPS0      EQU  H'0000'
I2C1SCLPPS1      EQU  H'0001'
I2C1SCLPPS2      EQU  H'0002'
I2C1SCLPPS3      EQU  H'0003'
I2C1SCLPPS4      EQU  H'0004'
I2C1SCLPPS5      EQU  H'0005'
I2C1SCLPPS0      EQU  H'0000'
I2C1SCLPPS1      EQU  H'0001'
I2C1SCLPPS2      EQU  H'0002'
I2C1SCLPPS3      EQU  H'0003'
I2C1SCLPPS4      EQU  H'0004'
I2C1SCLPPS5      EQU  H'0005'


;----- U2RXPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U2RXPPS0         EQU  H'0000'
U2RXPPS1         EQU  H'0001'
U2RXPPS2         EQU  H'0002'
U2RXPPS3         EQU  H'0003'
U2RXPPS4         EQU  H'0004'
U2RXPPS5         EQU  H'0005'
U2RXPPS0         EQU  H'0000'
U2RXPPS1         EQU  H'0001'
U2RXPPS2         EQU  H'0002'
U2RXPPS3         EQU  H'0003'
U2RXPPS4         EQU  H'0004'
U2RXPPS5         EQU  H'0005'


;----- U2CTSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U2CTSPPS0        EQU  H'0000'
U2CTSPPS1        EQU  H'0001'
U2CTSPPS2        EQU  H'0002'
U2CTSPPS3        EQU  H'0003'
U2CTSPPS4        EQU  H'0004'
U2CTSPPS5        EQU  H'0005'
U2CTSPPS0        EQU  H'0000'
U2CTSPPS1        EQU  H'0001'
U2CTSPPS2        EQU  H'0002'
U2CTSPPS3        EQU  H'0003'
U2CTSPPS4        EQU  H'0004'
U2CTSPPS5        EQU  H'0005'


;----- U3RXPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U3RXPPS0         EQU  H'0000'
U3RXPPS1         EQU  H'0001'
U3RXPPS2         EQU  H'0002'
U3RXPPS3         EQU  H'0003'
U3RXPPS4         EQU  H'0004'
U3RXPPS5         EQU  H'0005'
U3RXPPS0         EQU  H'0000'
U3RXPPS1         EQU  H'0001'
U3RXPPS2         EQU  H'0002'
U3RXPPS3         EQU  H'0003'
U3RXPPS4         EQU  H'0004'
U3RXPPS5         EQU  H'0005'


;----- U3CTSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U3CTSPPS0        EQU  H'0000'
U3CTSPPS1        EQU  H'0001'
U3CTSPPS2        EQU  H'0002'
U3CTSPPS3        EQU  H'0003'
U3CTSPPS4        EQU  H'0004'
U3CTSPPS5        EQU  H'0005'
U3CTSPPS0        EQU  H'0000'
U3CTSPPS1        EQU  H'0001'
U3CTSPPS2        EQU  H'0002'
U3CTSPPS3        EQU  H'0003'
U3CTSPPS4        EQU  H'0004'
U3CTSPPS5        EQU  H'0005'


